In [1]:
%matplotlib notebook

In [2]:
import pandas as pd
import matplotlib as plt

In [ ]:
# Bernt's code starts here

In [3]:
# Importing necessary dataframes

birthrate_csv = "../project-one/Resources/children_per_woman_total_fertility.csv"
birthrate_df = pd.read_csv(birthrate_csv)
birthrate_df.head()

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,Afghanistan,7.00,7.00,7.00,7.00,7.00,7.00,7.00,7.00,7.00,...,6.04,5.82,5.60,5.38,5.17,4.98,4.80,4.64,4.48,4.33
1,Albania,4.60,4.60,4.60,4.60,4.60,4.60,4.60,4.60,4.60,...,1.65,1.65,1.67,1.69,1.70,1.71,1.71,1.71,1.71,1.71
2,Algeria,6.99,6.99,6.99,6.99,6.99,6.99,6.99,6.99,6.99,...,2.83,2.89,2.93,2.94,2.92,2.89,2.84,2.78,2.71,2.64
3,Angola,6.93,6.93,6.93,6.93,6.93,6.93,6.93,6.94,6.94,...,6.24,6.16,6.08,6.00,5.92,5.84,5.77,5.69,5.62,5.55
4,Antigua and Barbuda,5.00,5.00,4.99,4.99,4.99,4.98,4.98,4.97,4.97,...,2.15,2.13,2.12,2.10,2.09,2.08,2.06,2.05,2.04,2.03

In [30]:
co2_csv = "../project-one/Resources/co2_emissions_tonnes_per_person.csv"
co2_df = pd.read_csv(co2_csv)
co2_df.head()

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0529,0.0637,0.0854,0.154,0.242,0.294,0.412,0.35,0.316,0.299
1,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1.3800,1.2800,1.3000,1.460,1.480,1.560,1.790,1.68,1.730,1.960
2,Algeria,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,3.2200,2.9900,3.1900,3.160,3.420,3.300,3.290,3.46,3.510,3.720
3,Andorra,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,7.3000,6.7500,6.5200,6.430,6.120,6.120,5.870,5.92,5.900,5.830
4,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.9800,1.1000,1.2000,1.180,1.230,1.240,1.250,1.33,1.250,1.290

In [29]:
income_csv = "../project-one/Resources/income_per_person_gdppercapita_ppp_inflation_adjusted.csv"
income_df = pd.read_csv(income_csv)
income_df.head()
# units are in dollars, I believe

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2031,2032,2033,2034,2035,2036,2037,2038,2039,2040
0,Afghanistan,603,603,603,603,603,603,603,603,603,...,2420,2470,2520,2580,2640,2700,2760,2820,2880,2940
1,Albania,667,667,667,667,667,668,668,668,668,...,18500,18900,19300,19700,20200,20600,21100,21500,22000,22500
2,Algeria,715,716,717,718,719,720,721,722,723,...,15600,15900,16300,16700,17000,17400,17800,18200,18600,19000
3,Andorra,1200,1200,1200,1200,1210,1210,1210,1210,1220,...,73200,74800,76400,78100,79900,81600,83400,85300,87200,89100
4,Angola,618,620,623,626,628,631,634,637,640,...,6270,6410,6550,6700,6850,7000,7150,7310,7470,7640

In [6]:
population_csv = "../project-one/Resources/population_total.csv"
population_df = pd.read_csv(population_csv)
population_df.head()

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2091,2092,2093,2094,2095,2096,2097,2098,2099,2100
0,Afghanistan,3280000,3280000,3280000,3280000,3280000,3280000,3280000,3280000,3280000,...,71900000,71800000,71600000,71500000,71300000,71200000,71000000,70800000,70600000,70400000
1,Albania,410000,412000,413000,414000,416000,417000,418000,420000,421000,...,1820000,1800000,1780000,1760000,1740000,1720000,1710000,1690000,1670000,1660000
2,Algeria,2500000,2510000,2520000,2530000,2540000,2550000,2560000,2570000,2580000,...,62800000,62800000,62800000,62800000,62800000,62800000,62700000,62700000,62600000,62600000
3,Andorra,2650,2650,2650,2650,2650,2650,2650,2650,2650,...,64300,64200,64100,63900,63800,63700,63500,63400,63300,63100
4,Angola,1570000,1570000,1570000,1570000,1570000,1570000,1570000,1570000,1570000,...,156000000,158000000,160000000,162000000,164000000,166000000,167000000,169000000,171000000,173000000

In [ ]:
# For reference only:
# these are the years we are interested in:  [1804, 1834, 1864, 1894, 1824, 1954, 1984, and 2014]

In [ ]:
# Step 2: Merge the data...BUT FIRST!! To prep for an inner join (where the only data merged is
# whatever matches in our reference columns), we can dropna() first, and then merge

# Removing "not a number's"

#birthrate_df = birthrate_df.dropna()
#co2_df = co2_df.dropna()

In [ ]:
# Step 3: Clean the data (dropna, isolate the specific year columns we're interested in)

In [ ]:
# Step 4: Plot our data with CO2 emissions on the x-axis, and birthrate on the y-axis
# BONUS: try formatting dot size by population or income level

In [ ]:
# Bernt's code ends here

In [ ]:
# Kaan's code starts here

In [ ]:
# Kaan's code ends here

In [ ]:
# Molly's code starts here

1864 work

In [ ]:
#pull out 1864 birthrate per country
birthrate_1864_df = birthrate_df[["country", "1864"]]
birthrate_1864_df.head()

In [ ]:
#pull out 1864 CO2 per country
co2_1864_df = co2_df[["country", "1864"]]
co2_1864_df.head()

In [ ]:
#merge co2 and birthrate for 1864
merge_brate_co2_1864_df = pd.merge(birthrate_1864_df,co2_1864_df, on="country", how="right")
merge_brate_co2_1864_df = merge_brate_co2_1864_df.dropna()
merge_brate_co2_1864_df.head()

In [ ]:
#rename the columns
renamed_df=merge_brate_co2_1864_df.rename(columns={"1864_x":"1864 Birthrate", "1864_y":"1864 CO2"})
renamed_df.head()

In [ ]:
#Molly--continue to merge the dataframes so you ultimately have one dataframe with a column for each 
#data (population and income). Then make a scatter plot to see what that looks like -- think about other
#plots that would make sense and what other questions to ask

In [ ]:
#pull out 1864 income for each country
income_1864_df = income_df[["country", "1864"]]
income_1864_df.head()

In [ ]:
#pull out the 1864 population for each country
pop_1864_df = population_df[["country", "1864"]]
pop_1864_df.head()

In [ ]:
#merge income and population for 1864
merge_inc_pop_1864_df = pd.merge(income_1864_df,pop_1864_df, on="country", how="right")
merge_inc_pop_1864_df = merge_inc_pop_1864_df.dropna()
merge_inc_pop_1864_df.head()

In [ ]:
#rename the columns
renamedPI_df=merge_inc_pop_1864_df.rename(columns={"1864_x":"1864 income", "1864_y":"1864 population"})
renamedPI_df.head()

In [ ]:
#merge all 4 for 1864
merge_all_1864_df = pd.merge(renamedPI_df,renamed_df, on="country", how="right")
merge_all_1864_df

In [ ]:
#Then make a scatter plot to see what that looks like -- think about other plots that would make 
# sense and what other questions to ask

1894 work

In [ ]:
#pull out 1894 birthrate per country
birthrate_1894_df = birthrate_df[["country", "1894"]]
birthrate_1894_df

In [ ]:
#pull out 1894 CO2 per country
co2_1894_df = co2_df[["country", "1894"]]
co2_1894_df

In [ ]:
#merge co2 and birthrate for 1894
merge_brate_co2_1894_df = pd.merge(birthrate_1894_df,co2_1894_df, on="country", how="right")
#merge_brate_co2_1894_df = merge_brate_co2_1894_df.dropna()
len(merge_brate_co2_1894_df)

In [ ]:
#rename the columns
renamed94a_df=merge_brate_co2_1894_df.rename(columns={"1894_x":"1894 Birthrate", "1894_y":"1894 CO2"})
renamed94a_df.head()

In [ ]:
#pull out 1894 income for each country
income_1894_df = income_df[["country", "1894"]]
income_1894_df.head()

In [ ]:
#pull out the 1894 population for each country
pop_1894_df = population_df[["country", "1894"]]
pop_1894_df.head()

In [ ]:
#merge income and population for 1894
merge_inc_pop_1894_df = pd.merge(income_1894_df,pop_1894_df, on="country", how="inner")
merge_inc_pop_1894_df = merge_inc_pop_1894_df.dropna()
merge_inc_pop_1894_df

In [ ]:
#rename the columns
renamedPI94_df=merge_inc_pop_1894_df.rename(columns={"1894_x":"1894 income", "1894_y":"1894 population"})
renamedPI94_df.head()

In [ ]:
#can the join type change to get more data?
#merge all 4 for 1894
merge_all_1894_df = pd.merge(renamedPI94_df,renamed94a_df, on="country", how="inner")
merge_all_1894_df

In [ ]:
income_df.head()

In [56]:
#melt the income dataframe to show every Country|Year with the income for that year -- then group by year and country
df_meltInc =income_df.melt(id_vars=['country'], var_name='year', value_name='income')
df_meltInc = df_meltInc.dropna()
df_meltInc.groupby(['year','country']).sum()

                  income
year country
1800 Afghanistan     603
     Albania         667
     Algeria         715
     Andorra        1200
     Angola          618
...                  ...
2040 Venezuela     17600
     Vietnam       12300
     Yemen          3960
     Zambia         6590
     Zimbabwe       3210

[46513 rows x 1 columns]

In [53]:
#melt the co2 dataframe to show every Country|Year with the co2 for that year -- then group by year and country
df_meltCO2 =co2_df.melt(id_vars=['country'], var_name='year', value_name='co2')
df_meltCO2 = df_meltCO2.dropna()
df_meltCO2.groupby(['year','country']).sum()

                         co2
year country
1800 Canada          0.00568
     Germany         0.03480
     Poland          0.04280
     United Kingdom  2.16000
     United States   0.03720
...                      ...
2014 Venezuela       6.03000
     Vietnam         1.80000
     Yemen           0.86500
     Zambia          0.28800
     Zimbabwe        0.78000

[16844 rows x 1 columns]

In [60]:
#merge the melted income and co2
merge_inc_co2_df = pd.merge(df_meltInc,df_meltCO2, on="country", how="outer")
merge_inc_co2_df

               country year_x  income year_y      co2
0          Afghanistan   1800   603.0   1949  0.00191
1          Afghanistan   1800   603.0   1950  0.01090
2          Afghanistan   1800   603.0   1951  0.01170
3          Afghanistan   1800   603.0   1952  0.01150
4          Afghanistan   1800   603.0   1953  0.01320
...                ...    ...     ...    ...      ...
4057961  Liechtenstein    NaN     NaN   2010  1.53000
4057962  Liechtenstein    NaN     NaN   2011  1.31000
4057963  Liechtenstein    NaN     NaN   2012  1.30000
4057964  Liechtenstein    NaN     NaN   2013  1.39000
4057965  Liechtenstein    NaN     NaN   2014  1.19000

[4057966 rows x 5 columns]

I don't think melt is the function I want to use to reshape the columns. The merged result isn't getting the result I'm after, which is the index of year listing the country|CO2|Income

In [37]:
df_col = pd.concat([income_df,co2_df], axis=1)
df_col

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014
0,Afghanistan,603,603,603,603,603,603,603,603,603,...,0.0529,0.0637,0.0854,0.154,0.242,0.294,0.412,0.350,0.316,0.299
1,Albania,667,667,667,667,667,668,668,668,668,...,1.3800,1.2800,1.3000,1.460,1.480,1.560,1.790,1.680,1.730,1.960
2,Algeria,715,716,717,718,719,720,721,722,723,...,3.2200,2.9900,3.1900,3.160,3.420,3.300,3.290,3.460,3.510,3.720
3,Andorra,1200,1200,1200,1200,1210,1210,1210,1210,1220,...,7.3000,6.7500,6.5200,6.430,6.120,6.120,5.870,5.920,5.900,5.830
4,Angola,618,620,623,626,628,631,634,637,640,...,0.9800,1.1000,1.2000,1.180,1.230,1.240,1.250,1.330,1.250,1.290
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
188,Venezuela,682,682,682,682,682,682,682,682,682,...,1.1600,1.2100,1.2200,1.360,1.470,1.610,1.700,1.570,1.610,1.800
189,Vietnam,861,861,861,861,861,861,861,861,862,...,0.9740,1.0100,0.9640,0.999,1.070,0.993,0.811,0.749,0.997,0.865
190,Yemen,877,879,882,884,887,889,892,894,897,...,0.1900,0.1850,0.1520,0.166,0.186,0.194,0.206,0.249,0.261,0.288
191,Zambia,663,665,667,668,670,671,673,675,676,...,0.8320,0.7960,0.7420,0.573,0.406,0.552,0.665,0.530,0.776,0.780
192,Zimbabwe,869,870,871,872,873,874,875,876,877,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [41]:
#try the merge first
merge_orig_df = pd.merge(income_df,co2_df, on="country", how="inner", suffixes=('_income','_co2'))
merge_orig_df

,country,1800_income,1801_income,1802_income,1803_income,1804_income,1805_income,1806_income,1807_income,1808_income,...,2005_co2,2006_co2,2007_co2,2008_co2,2009_co2,2010_co2,2011_co2,2012_co2,2013_co2,2014_co2
0,Afghanistan,603,603,603,603,603,603,603,603,603,...,0.0529,0.0637,0.0854,0.154,0.242,0.294,0.412,0.350,0.316,0.299
1,Albania,667,667,667,667,667,668,668,668,668,...,1.3800,1.2800,1.3000,1.460,1.480,1.560,1.790,1.680,1.730,1.960
2,Algeria,715,716,717,718,719,720,721,722,723,...,3.2200,2.9900,3.1900,3.160,3.420,3.300,3.290,3.460,3.510,3.720
3,Andorra,1200,1200,1200,1200,1210,1210,1210,1210,1220,...,7.3000,6.7500,6.5200,6.430,6.120,6.120,5.870,5.920,5.900,5.830
4,Angola,618,620,623,626,628,631,634,637,640,...,0.9800,1.1000,1.2000,1.180,1.230,1.240,1.250,1.330,1.250,1.290
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
186,Venezuela,682,682,682,682,682,682,682,682,682,...,6.1600,6.2200,5.8100,6.360,6.290,6.510,6.000,6.650,6.070,6.030
187,Vietnam,861,861,861,861,861,861,861,861,862,...,1.1600,1.2100,1.2200,1.360,1.470,1.610,1.700,1.570,1.610,1.800
188,Yemen,877,879,882,884,887,889,892,894,897,...,0.9740,1.0100,0.9640,0.999,1.070,0.993,0.811,0.749,0.997,0.865
189,Zambia,663,665,667,668,670,671,673,675,676,...,0.1900,0.1850,0.1520,0.166,0.186,0.194,0.206,0.249,0.261,0.288
190,Zimbabwe,869,870,871,872,873,874,875,876,877,...,0.8320,0.7960,0.7420,0.573,0.406,0.552,0.665,0.530,0.776,0.780

In [27]:
#melt the merged orig dataframe to get Year|Country|Income|CO2
df_meltOrig =merge_orig_df.melt(id_vars=['country'], var_name='1800_x', value_name='country')
#df_meltOrig = df_meltOrig.dropna()
df_meltOrig

        country  1800_x   country
0       603.000  1800_x   603.000
1       667.000  1800_x   667.000
2       715.000  1800_x   715.000
3      1200.000  1800_x  1200.000
4       618.000  1800_x   618.000
...         ...     ...       ...
87091     6.030  2014_y     6.030
87092     1.800  2014_y     1.800
87093     0.865  2014_y     0.865
87094     0.288  2014_y     0.288
87095     0.780  2014_y     0.780

[87096 rows x 3 columns]

Make a giant dataframe that has Year as the index. Then columns would be Country, Income, 
CO2 (or whatever). Then make a new column that computes the ratio of Income to CO2. Then make another dataframe 
for each country. Then plot year and ratio using a line chart.Then you could look at the richest/poorest/least populous countries on a couple different charts

In [ ]:
usa.df = df[merge_orig_df['country']=='United States']

In [ ]:
#turns out I don't need to concat the country and year because I don't need to label to points that are plotted. So when
#I merge the 2 unpivoted dataframes I can then do the plot. Then maybe I can do regression to see what's up there.
country = pd.Series(df_unpivotedCO2['country'])
year = pd.Series(df_unpivotedCO2['year'])
pd.concat([country, year],ignore_index=True)

In [ ]:
#didn't work--come back to this after you fix the concat
#merge the unpivoted 1894 dataframes
merge_1894_df = pd.merge(df_unpivotedInc,df_unpivotedCO2, on="country", how="inner")
merge_1894_df

In [ ]:
#then merge those two pivots and plot all those points using income as X and co2 as Y

In [ ]:
# Molly's code stops here

In [ ]:
# Vallie's code starts here

In [ ]:
# Vallie's code stops here